In [1]:
# Importing all the necessary Libraries 
import pandas as pd 
import numpy as np
import psycopg2
from sqlalchemy import create_engine

In [2]:
# Loading all the data into Python
Employee_df = pd.read_csv(r"C:\Users\Aditi 732\Desktop\Aditi\Data Science\Final Projects - DA\HR Analytics Pipeline\Data\Employee_Details.csv")

In [3]:
Employee_df.head()

,Employee_ID,Name,Age,Gender,Ethnicity,Marital_Status,Hire_Date,Job_Role,Department,Employment_Type,Tenure
0,1,Employee_1,54,Male,Asian,Divorced,2010-01-01,Software Engineer,Data Science,Full-Time,14
1,2,Employee_2,26,Male,Hispanic,Divorced,2010-01-08,HR Specialist,HR,Full-Time,13
2,3,Employee_3,37,Male,Other,Widowed,2010-01-15,Data Analyst,Data Science,Part-Time,13
3,4,Employee_4,42,Male,African American,Married,2010-01-22,Sales Executive,Data Science,Part-Time,13
4,5,Employee_5,54,Female,Asian,Married,2010-01-29,Sales Executive,HR,Part-Time,13

In [4]:
performance_df = pd.read_csv(r"C:\Users\Aditi 732\Desktop\Aditi\Data Science\Final Projects - DA\HR Analytics Pipeline\Data\Performance_Reviews.csv")

In [5]:
performance_df.head()

   Employee_ID Review_Date  Performance_Rating Manager_Comments
0            1  2015-01-31                   1             Poor
1            1  2015-07-31                   3    Below Average
2            1  2016-01-31                   4             Good
3            1  2016-07-31                   2        Excellent
4            1  2017-01-31                   3             Good

In [6]:
compensation_df = pd.read_csv(r"C:\Users\Aditi 732\Desktop\Aditi\Data Science\Final Projects - DA\HR Analytics Pipeline\Data\Compensation.csv")

In [7]:
compensation_df.head()

   Employee_ID  Salary  Bonuses  Raises Compensation_Date
0            1   83548    14974    9798        2015-12-31
1            1   58073     9470    9696        2016-12-31
2            1  120711     8222    4560        2017-12-31
3            1  126536     1001    9547        2018-12-31
4            1  123758    19520      71        2019-12-31

In [8]:
workload_df = pd.read_csv(r"C:\Users\Aditi 732\Desktop\Aditi\Data Science\Final Projects - DA\HR Analytics Pipeline\Data\Workload.csv")

In [9]:
workload_df.head()

   Employee_ID  Hours_Worked Project_Involvement Workload_Distribution
0            1            32                High                  Even
1            2            43                High                Uneven
2            3            43                 Low                Uneven
3            4            38              Medium                Uneven
4            5            45              Medium                Uneven

In [10]:
exit_df = pd.read_csv(r"C:\Users\Aditi 732\Desktop\Aditi\Data Science\Final Projects - DA\HR Analytics Pipeline\Data\Exit_Interviews.csv")

In [11]:
exit_df.head()

,Employee_ID,Exit_Date,Reason_For_Leaving,Satisfaction_Rating,Feedback_Comments
0,103,2015-01-01 00:00:00.000000000,Better Opportunity,2,Negative
1,1456,2015-01-23 01:26:58.791946308,Relocation,10,Neutral
2,1434,2015-02-14 02:53:57.583892617,Personal Reasons,6,Positive
3,1476,2015-03-08 04:20:56.375838926,Job Dissatisfaction,9,Positive
4,775,2015-03-30 05:47:55.167785235,Personal Reasons,4,Negative

### Cleaning the data

In [12]:
Employee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Employee_ID      1500 non-null   int64
 1   Name             1500 non-null   object
 2   Age              1500 non-null   int64
 3   Gender           1500 non-null   object
 4   Ethnicity        1500 non-null   object
 5   Marital_Status   1500 non-null   object
 6   Hire_Date        1500 non-null   object
 7   Job_Role         1500 non-null   object
 8   Department       1500 non-null   object
 9   Employment_Type  1500 non-null   object
 10  Tenure           1500 non-null   int64
dtypes: int64(3), object(8)
memory usage: 129.0+ KB

In [13]:
# Converting Hire Date into Date time

Employee_df['Hire_Date'] = pd.to_datetime(Employee_df['Hire_Date'])

In [14]:
Employee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Employee_ID      1500 non-null   int64
 1   Name             1500 non-null   object
 2   Age              1500 non-null   int64
 3   Gender           1500 non-null   object
 4   Ethnicity        1500 non-null   object
 5   Marital_Status   1500 non-null   object
 6   Hire_Date        1500 non-null   datetime64[ns]
 7   Job_Role         1500 non-null   object
 8   Department       1500 non-null   object
 9   Employment_Type  1500 non-null   object
 10  Tenure           1500 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(7)
memory usage: 129.0+ KB

In [15]:
performance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27000 entries, 0 to 26999
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         27000 non-null  int64
 1   Review_Date         27000 non-null  object
 2   Performance_Rating  27000 non-null  int64
 3   Manager_Comments    27000 non-null  object
dtypes: int64(2), object(2)
memory usage: 843.9+ KB

In [16]:
## Checking for duplicates
value_counts = performance_df['Employee_ID'].value_counts()
duplicates = value_counts[value_counts>1]
print(duplicates)

1       18
998     18
1007    18
1006    18
1005    18
        ..
498     18
497     18
496     18
495     18
1500    18
Name: Employee_ID, Length: 1500, dtype: int64

In [17]:
# Duplicate data is required over here as one employee can have many ratings

In [18]:
# Converting Review date to datetime
performance_df['Review_Date'] = pd.to_datetime(performance_df['Review_Date'])

In [19]:
performance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27000 entries, 0 to 26999
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         27000 non-null  int64
 1   Review_Date         27000 non-null  datetime64[ns]
 2   Performance_Rating  27000 non-null  int64
 3   Manager_Comments    27000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 843.9+ KB

In [20]:
# Exploring Compensation Table

compensation_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13500 entries, 0 to 13499
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        13500 non-null  int64
 1   Salary             13500 non-null  int64
 2   Bonuses            13500 non-null  int64
 3   Raises             13500 non-null  int64
 4   Compensation_Date  13500 non-null  object
dtypes: int64(4), object(1)
memory usage: 527.5+ KB

In [21]:
# Converting Compensation Date into Date time value

compensation_df['Compensation_Date'] = pd.to_datetime(compensation_df['Compensation_Date'])

In [22]:
# Checking for duplicates
value_count = compensation_df['Employee_ID'].value_counts()
dup_value = value_counts[value_count>1]
print(dup_value)

1       18
998     18
1007    18
1006    18
1005    18
        ..
498     18
497     18
496     18
495     18
1500    18
Name: Employee_ID, Length: 1500, dtype: int64

In [23]:
workload_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee_ID            1500 non-null   int64
 1   Hours_Worked           1500 non-null   int64
 2   Project_Involvement    1500 non-null   object
 3   Workload_Distribution  1500 non-null   object
dtypes: int64(2), object(2)
memory usage: 47.0+ KB

In [24]:
# Checking for null values
workload_df.isnull().sum()

Employee_ID              0
Hours_Worked             0
Project_Involvement      0
Workload_Distribution    0
dtype: int64

In [25]:
workload_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1495    False
1496    False
1497    False
1498    False
1499    False
Length: 1500, dtype: bool

In [26]:
# Exploring Exit Data
exit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          150 non-null    int64
 1   Exit_Date            150 non-null    object
 2   Reason_For_Leaving   150 non-null    object
 3   Satisfaction_Rating  150 non-null    int64
 4   Feedback_Comments    150 non-null    object
dtypes: int64(2), object(3)
memory usage: 6.0+ KB

In [27]:
exit_df['Exit_Date'] = pd.to_datetime(exit_df['Exit_Date'])

In [28]:
exit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          150 non-null    int64
 1   Exit_Date            150 non-null    datetime64[ns]
 2   Reason_For_Leaving   150 non-null    object
 3   Satisfaction_Rating  150 non-null    int64
 4   Feedback_Comments    150 non-null    object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 6.0+ KB

### Connecting to PostgreSQL to load our dataset

In [71]:
# connection

try :
    conn = psycopg2.connect(dbname = "HR_Analysis", user = 'postgres', password = 'password', port = '5432')
except : 
    print("Connection was unsuccessful")

In [72]:
cur = conn.cursor()

In [73]:
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/HR_Analysis')

### Create tables in PostgreSQL

In [74]:
cur.execute("""
DROP TABLE IF EXISTS employee;
CREATE TABLE IF NOT EXISTS employee(
employee_id INTEGER PRIMARY KEY , 
name VARCHAR(255),
age INTEGER,
gender VARCHAR(50),       
ethnicity VARCHAR(50),       
marital_status VARCHAR(50),
hire_date DATE,       
job_role VARCHAR(255),              
department VARCHAR(255),       
employment_Type VARCHAR(255),
tenure INTEGER
)""")

In [75]:
cur.execute("""
CREATE TABLE IF NOT EXISTS performance(
employee_id INTEGER,
review_date DATE,
performance_rating INTEGER, 
manager_comments VARCHAR(50)
)""")

In [76]:
cur.execute("""
CREATE TABLE IF NOT EXISTS compensation(
employee_id INTEGER,
salary NUMERIC(10,2),
bonus NUMERIC(10,2),
raise NUMERIC(10,2),
compensation_date DATE
)""")

In [77]:
cur.execute("""
CREATE TABLE IF NOT EXISTS workload(
employee_id INTEGER,
hours INTEGER,
project_invlovement VARCHAR(50),
workload VARCHAR(50)
)""")

In [78]:
cur.execute("""
CREATE TABLE IF NOT EXISTS exit(
employee_id INTEGER,
exit_date DATE,
reason VARCHAR(255),
statisfaction_rating INTEGER,
feedback_comments VARCHAR(50)
)""")

### Loading all the data from python to SQL

In [79]:
conn.commit()

In [80]:
def bulk_insert(df, table_name):
    # Write DataFrame to a CSV file buffer
    if 'ID' in df.columns:
        df = df.drop(columns=['ID'])
    df.to_csv(f'/tmp/{table_name}.csv', index=False, header=False)
    
    # Use copy_expert to load data into PostgreSQL
    with open(f'/tmp/{table_name}.csv', 'r') as f:
        cur.copy_expert(f"COPY {table_name} FROM STDIN WITH CSV", f)
    conn.commit()
        
# Loading data from pandas DataFrames to SQL
bulk_insert(Employee_df,'employee')
bulk_insert(performance_df, 'performance')
bulk_insert(compensation_df, 'compensation')
bulk_insert(workload_df, 'workload')
bulk_insert(exit_df, 'exit')

### All the data has been transferred from Python to SQL for further Analysis!